# 内置版单神经元.py
# 2026.4.23
# 作者：蜉蝣
# 编码：utf-8


def 神经元():
    输入列表 = [complex(input(f"{i}：")) for i in range(1, 6)]
    输出 = sum(输入列表)
    兴奋性阈值 = 3 + 0j
    抑制性阈值 = 0 + 3j
    兴奋 = 输出.real > 兴奋性阈值.real
    抑制 = 输出.imag > 抑制性阈值.imag
    # 根据兴奋或抑制状态输出相应的复数形式
    if 兴奋 and 抑制:
       # 同时满足兴奋和抑制条件，优先输出兴奋状态
      激活输出 = 输出.real + 0j
    elif 兴奋:
        激活输出 = 输出.real + 0j
    elif 抑制:
        激活输出 = 0 + 输出.imag * 1j
    else:
        激活输出 = 0
    激活状态 = 1 if 兴奋 or 抑制 else 0
    return 激活状态, 激活输出

激活状态, 激活输出 = 神经元()

print(激活状态, 激活输出)

